NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_radiocore.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="WDT010_NS">
      <name>WDT010_S</name>
      <description>Watchdog Timer 1</description>
      <baseAddress>0x53013000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>WDT010</name>
        <value>19</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="WDT010_NS">
      <name>WDT011_NS</name>
      <description>Watchdog Timer 2</description>
      <baseAddress>0x43014000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>WDT011</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="WDT010_NS">
      <name>WDT011_S</name>
      <description>Watchdog Timer 3</description>
      <baseAddress>0x53014000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>WDT011</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LRCCONF000_NS">
      <name>LRCCONF010_NS</name>
      <description>LRCCONF 2</description>
      <baseAddress>0x4301E000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>RESETINFO_NS</name>
      <description>RESETINFO 0</description>
      <baseAddress>0x4301E000</baseAddress>
      <alternatePeripheral>LRCCONF010_NS</alternatePeripheral>
      <headerStructName>RESETINFO</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>RESETINFO</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>RESETREAS</name>
          <description>Unspecified</description>
          <headerStructName>RESETINFO_RESETREAS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x4A0</addressOffset>
          <register>
            <name>GLOBAL</name>
            <description>Global reset reason.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESETPORONLY</name>
                <description>Reset from power on reset (reset reason POR or BOR).</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETPIN</name>
                <description>Reset from pin reset detected.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DOG</name>
                <description>Reset from the SysCtrl watchdog timer detected.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTRLAP</name>
                <description>Reset from CTRL-AP detected.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECSREQ</name>
                <description>Reset due to secure domain system reset request.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECWDT0</name>
                <description>Reset due to the first instance of watchdog timer in secure domain detected.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECWDT1</name>
                <description>Reset due to the second instance of watchdog timer in secure domain detected.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECLOCKUP</name>
                <description>Reset due to secure domain lockup.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECTAMPER</name>
                <description>Reset due to secure domain tamper detected</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETPOR</name>
                <description>Reset from power on reset (reset reason other than POR or BOR).</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OFF</name>
                <description>Reset due to wakeup from System OFF mode when wakeup is triggered by DETECT signal from GPIO.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPCOMP</name>
                <description>Reset due to wakeup from System OFF mode when wakeup is triggered by LPCOMP (Low Power Comparator).</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIF</name>
                <description>Reset due to wakeup from System OFF mode when wakeup is triggered by entering the debug interface mode.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GRTC</name>
                <description>Reset due to wakeup from System OFF mode when wakeup is triggered by GRTC interrupt.</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NFC</name>
                <description>Reset due to wakeup from System OFF mode when wakeup is triggered by NFC field detection in sense mode.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VUSB</name>
                <description>Reset after wakeup from System OFF mode due to VBUS rising into valid range.</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LOCAL</name>
            <description>Local reset reason.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WDT0</name>
                <description>Reset from the local watchdog timer 0 detected</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WDT1</name>
                <description>Reset from the local watchdog timer 1 detected</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SREQ</name>
                <description>Reset from the local soft reset request detected.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCKUP</name>
                <description>Reset from local CPU lockup detected</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotDetected</name>
                    <description>Not detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Detected</name>
                    <description>Detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNRETAINEDWAKE</name>
                <description>Reset due to wake from unretained state.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>ERROR</name>
          <description>Unspecified</description>
          <headerStructName>RESETINFO_ERROR</headerStructName>
          <access>read-write</access>
          <addressOffset>0x4A8</addressOffset>
          <register>
            <name>STATUS</name>
            <description>Reset error status.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRORSTATUS</name>
                <description>Error status</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ADDRESS</name>
            <description>Reset error address.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRORADDRESS</name>
                <description>Error address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>RESTOREVALID</name>
          <description>Valid restore image is present in RAM.</description>
          <addressOffset>0x4C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RESTOREVALID</name>
              <description>Valid restore image is present in RAM.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotPreset</name>
                  <description>Not present</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
