NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_radiocore.svd
          <register>
            <name>ADDRESS</name>
            <description>Latest address being accessed on the Sink channel. If a bus error occurs, these registers will contain the address that cause the error.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Sink address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>JOBCOUNT</name>
            <description>Number of completed jobs in the current Sink descriptor list. This resets to 0 when a new joblist is started.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Sink job count</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_MVDMA120_NS">
      <name>GLOBAL_MVDMA120_S</name>
      <description>MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists.  Each transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and they contain data buffer information, address pointers, buffer sizes and data type attributes. 1</description>
      <baseAddress>0x5F8D9000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>MVDMA120</name>
        <value>217</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_RAMC122_NS</name>
      <description>RAM Controller 0</description>
      <baseAddress>0x4F8DA000</baseAddress>
      <headerStructName>RAMC</headerStructName>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>RAMC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>WAITSTATES</name>
          <description>Waitstates for read operations.</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>WAITSTATES</name>
              <description>Number of waitstates for a read from the RAM.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_RAMC122_NS">
      <name>GLOBAL_RAMC122_S</name>
      <description>RAM Controller 1</description>
      <baseAddress>0x5F8DA000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="DPPIC020_NS">
      <name>GLOBAL_DPPIC120_NS</name>
      <description>Distributed programmable peripheral interconnect controller 4</description>
      <baseAddress>0x4F8E1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="DPPIC020_NS">
      <name>GLOBAL_DPPIC120_S</name>
      <description>Distributed programmable peripheral interconnect controller 5</description>
      <baseAddress>0x5F8E1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="TIMER020_NS">
      <name>GLOBAL_TIMER120_NS</name>
      <description>Timer/Counter 6</description>
      <baseAddress>0x4F8E2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER120</name>
        <value>226</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER020_NS">
      <name>GLOBAL_TIMER120_S</name>
      <description>Timer/Counter 7</description>
      <baseAddress>0x5F8E2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER120</name>
        <value>226</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER020_NS">
      <name>GLOBAL_TIMER121_NS</name>
      <description>Timer/Counter 8</description>
      <baseAddress>0x4F8E3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER121</name>
        <value>227</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER020_NS">
      <name>GLOBAL_TIMER121_S</name>
      <description>Timer/Counter 9</description>
      <baseAddress>0x5F8E3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER121</name>
        <value>227</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_PWM120_NS</name>
      <description>Pulse width modulation unit 0</description>
      <baseAddress>0x4F8E4000</baseAddress>
      <headerStructName>PWM</headerStructName>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PWM120</name>
        <value>228</value>
      </interrupt>
      <groupName>PWM</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_STOP</name>
          <description>Stops PWM pulse generation on all channels at the end of current PWM period, and stops sequence playback</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stops PWM pulse generation on all channels at the end of current PWM period, and stops sequence playback</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_NEXTSTEP</name>
          <description>Steps by one value in the current sequence on all enabled channels if DECODER.MODE=NextStep. Does not cause PWM generation to start if not running.</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_NEXTSTEP</name>
              <description>Steps by one value in the current sequence on all enabled channels if DECODER.MODE=NextStep. Does not cause PWM generation to start if not running.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>TASKS_DMA</name>
          <description>Peripheral tasks.</description>
          <headerStructName>PWM_TASKS_DMA</headerStructName>
          <access>write-only</access>
          <addressOffset>0x010</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>SEQ[%s]</name>
            <description>Peripheral tasks.</description>
            <headerStructName>PWM_TASKS_DMA_SEQ</headerStructName>
            <access>write-only</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>START</name>
              <description>Description cluster: Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA.</description>
              <addressOffset>0x000</addressOffset>
              <access>write-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>START</name>
                  <description>Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Trigger</name>
                      <description>Trigger task</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STOP</name>
              <description>Description cluster: Stops operation using easyDMA. This does not trigger an END event.</description>
              <addressOffset>0x004</addressOffset>
              <access>write-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>STOP</name>
                  <description>Stops operation using easyDMA. This does not trigger an END event.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Trigger</name>
                      <description>Trigger task</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <register>
          <name>SUBSCRIBE_STOP</name>
          <description>Subscribe configuration for task STOP</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STOP will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_NEXTSTEP</name>
          <description>Subscribe configuration for task NEXTSTEP</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task NEXTSTEP will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>SUBSCRIBE_DMA</name>
          <description>Subscribe configuration for tasks</description>
          <headerStructName>PWM_SUBSCRIBE_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x090</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>SEQ[%s]</name>
            <description>Subscribe configuration for tasks</description>
            <headerStructName>PWM_SUBSCRIBE_DMA_SEQ</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>START</name>
              <description>Description cluster: Subscribe configuration for task START</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CHIDX</name>
                  <description>DPPI channel that task START will subscribe to</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>EN</name>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable subscription</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable subscription</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STOP</name>
              <description>Description cluster: Subscribe configuration for task STOP</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CHIDX</name>
                  <description>DPPI channel that task STOP will subscribe to</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>EN</name>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable subscription</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable subscription</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <register>
          <name>EVENTS_STOPPED</name>
          <description>Response to STOP task, emitted when PWM pulses are no longer generated</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_STOPPED</name>
              <description>Response to STOP task, emitted when PWM pulses are no longer generated</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_SEQSTARTED[%s]</name>
          <description>Description collection: First PWM period started on sequence n</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_SEQSTARTED</name>
              <description>First PWM period started on sequence n</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_SEQEND[%s]</name>
          <description>Description collection: Emitted at end of every sequence n, when last value from RAM has been applied to wave counter</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_SEQEND</name>
              <description>Emitted at end of every sequence n, when last value from RAM has been applied to wave counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_PWMPERIODEND</name>
          <description>Emitted at the end of each PWM period</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_PWMPERIODEND</name>
              <description>Emitted at the end of each PWM period</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_LOOPSDONE</name>
          <description>Concatenated sequences have been played the amount of times defined in LOOP.CNT</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_LOOPSDONE</name>
              <description>Concatenated sequences have been played the amount of times defined in LOOP.CNT</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RAMUNDERFLOW</name>
          <description>Emitted when retrieving from RAM does not complete in time for the PWM module</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_RAMUNDERFLOW</name>
              <description>Emitted when retrieving from RAM does not complete in time for the PWM module</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
